# SystemsAnalysisReportFolder Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SystemsAnalysisReportFolder Property
ParameterTypeId Class See Also
---
"Reports Folder Path"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SystemsAnalysisReportFolder { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SystemsAnalysisReportFolder As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SystemsAnalysisReportFolder {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace